In [1]:
pwd

'C:\\Users\\admin\\Desktop\\Personal stuff\\Datascience- Pandas with python\\Proj1-Housing'

In [2]:
#importing the libraries and modules
import pandas as pd
import numpy as np

In [3]:
#importing the dataset in csv format
df = pd.read_csv ("Housing-in-Mexico.csv")

## Data Cleaning

In [4]:
#Checking for the shape of the dataset i.e the number of observations and features
df.shape

(1000, 6)

In [5]:
#Checking for the datatypes of the dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  1000 non-null   object
 1   state          133 non-null    object
 2   latitude       1000 non-null   float64
 3   longitude      1000 non-null   float64
 4   area           1000 non-null   float64
 5   price          1000 non-null   object
dtypes: float64(3), object(3)
memory usage: 47.0+ KB

In [6]:
#Checking for the first 5 rows
df.head()

  property_type state   latitude   longitude    area     price
0     townhouse   NaN  43.258740   17.888008  434.97  $541,885
1         house   NaN  34.620202  112.453926  348.25  $601,831
2         condo   NaN  -4.163679   18.807620  729.05  $153,200
3     townhouse   NaN  22.826877  107.840624  431.57  $646,160
4         villa   NaN  27.483293  120.562211  135.08  $885,209

In [7]:
#Checking for the values in a particular column-shows frist and last 5
df['price']

0      $541,885
1      $601,831
2      $153,200
3      $646,160
4      $885,209
         ...
995    $432,552
996    $302,069
997    $568,993
998    $988,252
999    $135,854
Name: price, Length: 1000, dtype: object

In [8]:
#Checking for the values between observations (50-60) in price.
df.price[50:100]

50    $346,695
51    $538,717
52     $65,042
53    $757,693
54    $111,287
55    $527,265
56    $721,955
57    $251,340
58    $929,803
59    $889,551
60    $610,061
61    $640,505
62    $716,652
63    $873,687
64    $706,117
65    $840,951
66    $199,553
67    $373,818
68    $514,199
69    $318,472
70    $467,422
71    $781,967
72    $881,674
73    $622,820
74    $926,836
75    $795,561
76    $423,233
77    $606,249
78    $120,644
79    $543,792
80    $636,415
81    $679,586
82    $781,730
83    $616,530
84    $473,870
85     $18,291
86    $533,598
87    $506,064
88    $303,837
89    $980,281
90    $944,278
91    $646,322
92    $683,725
93    $476,000
94    $703,224
95    $466,121
96    $592,049
97    $715,139
98    $556,963
99     $31,455
Name: price, dtype: object

In [9]:
# Ensure 'price' column is of string data type
df['price'] = df['price'].astype(str)

"""To drop a column that is not needed or in use then use the method
df.drop(columns=["price"] inplace=True)"""

#To remove '$' and ',' from the price column and change the datatype to floating-point(float) for manipulation of data with pandas.
df["price"]= (
    df["price"]
    .str.replace("$" , "", regex=False)
    .str.replace("," , "")
    .astype(float)
)
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  1000 non-null   object
 1   state          133 non-null    object
 2   latitude       1000 non-null   float64
 3   longitude      1000 non-null   float64
 4   area           1000 non-null   float64
 5   price          1000 non-null   float64
dtypes: float64(4), object(2)
memory usage: 47.0+ KB

  property_type state   latitude   longitude    area     price
0     townhouse   NaN  43.258740   17.888008  434.97  541885.0
1         house   NaN  34.620202  112.453926  348.25  601831.0
2         condo   NaN  -4.163679   18.807620  729.05  153200.0
3     townhouse   NaN  22.826877  107.840624  431.57  646160.0
4         villa   NaN  27.483293  120.562211  135.08  885209.0